
/* Presented when a URL cannot be loaded because its scheme isn't understood */
"Don't know how to load URL %@" = "ไม่ทราบวิธีโหลด URL %@";

/* Presented when an HTTP URL cannot establish a connection with a particular host */
"Could not connect to host %@" = "ไม่สามารถเชื่อมต่อกับโฮสต์ %@";

/* Presented when a response from an HTTP server comes back with a bad format */
"Bad header received from server" = "ได้รับเฮดเดอร์ไม่สมบูรณ์จากเซิร์ฟเวอร์";

/* Presented when a description of a particular host can't be determined. */
"Can't determine IP address of host: %@" = "ไม่สามารถกำหนดที่อยู่ IP ของโฮสต์: %@";

/* Presented when the host description was found, but a particular port couldn't be opened. */
"Can't get a description of port %d" = "ไม่สามารถรับคำอธิบายของพอร์ต %d";

/* Presented when a particular host cannot be contacted via the given port */
"Can't connect to host %@ using port %d" = "ไม่สามารถเชื่อมต่อเข้ากับโฮสต์ %@ โดยใช้พอร์ต %d";

/* Presented when an HTTP server comes back with an unknown status code */
"Received unknown HTTP server response %@: %@" = "ได้รับการตอบสนองจากเซิร์ฟเวอร์ HTTP %@ ที่ไม่รู้จัก: %@";

/* Presented when an HTTP server returns a failure code */
"HTTP request failed for URL %@:%@" = "การร้องขอแบบ HTTP ไม่สำเร็จสำหรับ URL %@:%@";

/* Presented when the connection to an HTTP server is unexpectedly lost */
"Lost connection to host %@" = "เสียการเชื่อมต่อกับโฮสต์ %@";

/* Presented when a file can not be opened for reading (file may not exist) */
"Could not read from %@" = "ไม่สามารถอ่านจาก %@";

/* Presented when a redirection loop has been detected */
"Detected a redirection loop while attempting to load URL %@" = "ตรวจพบการเปลี่ยนทางวนกลับไปกลับมาในขณะที่พยายามโหลด URL %@";

/* Presented when an FTP server hangs up or becomes otherwise unavailable */
"Service unavailable for host %@" = "บริการยังไม่พร้อมสำหรับโฮสต์ %@";

/* Presented when the data transfer socket cannot be created for an FTP transfer */
"Couldn't open data connection for URL path: %@" = "ไม่สามารถเปิดการเชื่อมต่อข้อมูลสำหรับเส้นทาง URL: %@";

/* Presented when the indicated URL does not locate ane existing object on the server */
"Object not available for specified URL: %@" = "วัตถุไม่พร้อมสำหรับ URL ที่ระบุ: %@";

/* Presented when the FTP server doesn't recognize a particular command */
"FTP command not recognized by host: %@" = "คำสั่ง FTP ไม่ได้รับการจดจำจากโฮสต์: %@";

/* Presented when the FTP server rejects an authentication */
"User login or password not recognized." = "ID เข้าสู่ระบบของผู้ใช้หรือรหัสผ่านไม่ถูกต้อง";

/* Format used to display sizes 100 GB or greater */
"%.0f GB" = "%.0f กิกะไบต์";

/* Format used to display sizes between 100 and 999 KB */
"%.0f KB" = "%.0f กิโลไบต์";

/* Format used to display sizes between 100 and 999 MB */
"%.0f MB" = "%.0f เมกะไบต์";

/* Format used to display a size between 2 and 100 bytes */
"%.0f bytes" = "%.0f ไบต์";

/* Format used to display sizes between 1000 MB and 9.9 GB */
"%.1f GB (1.0)" = "%.1f กิกะไบต์";

/* Format used to display sizes between 10 and 99.9 GB */
"%.1f GB (10.0)" = "%.1f กิกะไบต์";

/* Format used to display sizes between 100 and 999 bytes */
"%.1f KB (0.1)" = "%.1f กิโลไบต์";

/* Format used to display sizes between 1000 bytes and 9.9 KB */
"%.1f KB (1.0)" = "%.1f กิโลไบต์";

/* Format used to display sizes between 10 and 99.9 KB */
"%.1f KB (10.0)" = "%.1f กิโลไบต์";

/* Format used to display sizes between 1000 KB and 9.9 MB */
"%.1f MB (1.0)" = "%.1f เมกะไบต์";

/* Format used to display sizes between 10 and 99.9 MB */
"%.1f MB (10.0)" = "%.1f เมกะไบต์";

/* Format string for label of a saved password in Keychain: URL (USERNAME) */
"%@ (%@)" = "%@ (%@)";

/* Format used to partial byte count along with total */
"%@ of %@" = "%@ จาก %@";

/* String used for showing a zero byte size */
"0 bytes" = "0 ไบต์";

/* String used for showing a one byte size */
"1 byte" = "1 ไบต์";

/* Kind string used for keychain items from forms-based logins */
"Web form password" = "รหัสผ่านของแบบฟอร์มบนเว็บ";

/* HTTP result code string */
"accepted" = "ได้ตอบรับ";

/* HTTP result code string */
"bad gateway" = "เกตเวย์ไม่สมบูรณ์";

/* HTTP result code string */
"bad request" = "คำขอไม่สมบูรณ์";

/* HTTP result code string */
"client error" = "ข้อผิดพลาดไคลเอนด์";

/* HTTP result code string */
"conflict" = "ขัดแย้ง";

/* HTTP result code string */
"continue" = "ต่อไป";

/* HTTP result code string */
"created" = "ได้สร้าง";

/* HTTP result code string */
"expectation failed" = "ไม่เป็นไปตามความคาดหวัง";

/* HTTP result code string */
"forbidden" = "ต้องห้าม";

/* HTTP result code string */
"found" = "หาพบ";

/* HTTP result code string */
"gateway timed out" = "เกตเวย์หมดเวลา";

/* HTTP result code string */
"informational" = "ให้ข้อมูล";

/* HTTP result code string */
"internal server error" = "ข้อผิดพลาดเซิร์ฟเวอร์ภายใน";

/* HTTP result code string */
"length required" = "ต้องกำหนดความยาว";

/* HTTP result code string */
"method not allowed" = "วิธีการไม่ได้รับอนุญาต";

/* HTTP result code string */
"moved permanently" = "ย้ายถาวร";

/* HTTP result code string */
"multiple choices" = "ข้อเลือกหลายข้อ";

/* HTTP result code string */
"needs proxy" = "ต้องใช้พร็อกซี่";

/* HTTP result code string */
"no content" = "ไม่มีเนื้อหา";

/* HTTP result code string */
"no error" = "ไม่มีข้อผิดพลาด";

/* HTTP result code string */
"no longer exists" = "ไม่มีอีกต่อไป";

/* HTTP result code string */
"non-authoritative information" = "ข้อมูลที่ไม่ต้องขออนุญาต";

/* HTTP result code string */
"not found" = "ไม่พบ";

/* HTTP result code string */
"not modified" = "ไม่ได้เปลี่ยน";

/* HTTP result code string */
"partial content" = "เนื้อหาบางส่วน";

/* HTTP result code string */
"payment required" = "ต้องเสียค่าใช้จ่าย";

/* HTTP result code string */
"precondition failed" = "เงื่อนไขเบื้องต้นไม่ผ่าน";

/* HTTP result code string */
"proxy authentication required" = "ต้องการรับรองความถูกต้องของพร็อกซี่";

/* HTTP result code string */
"redirected" = "ได้เปลี่ยนเส้นทาง";

/* HTTP result code string */
"request timed out" = "การขอหมดเวลา";

/* HTTP result code string */
"request too large" = "การขอใหญ่เกินไป";

/* HTTP result code string */
"requested URL too long" = "URL ร้องขอยาวเกินไป";

/* HTTP result code string */
"requested range not satisfiable" = "ช่วงร้องขอไม่เป็นไปตามต้องการ";

/* HTTP result code string */
"reset content" = "รีเซ็ตเนื้อหา";

/* HTTP result code string */
"see other" = "ดูอื่นๆ";

/* HTTP result code string */
"server error" = "ข้อผิดพลาดเซิร์ฟเวอร์";

/* HTTP result code string */
"service unavailable" = "บริการยังไม่พร้อม";

/* HTTP result code string */
"success" = "สำเร็จ";

/* HTTP result code string */
"switching protocols" = "กำลังสลับโปรโตคอล";

/* HTTP result code string */
"temporarily redirected" = "ได้เปลี่ยนเส้นทางชั่วคราว";

/* HTTP result code string */
"unacceptable" = "ยอมรับไม่ได้";

/* HTTP result code string */
"unauthorized" = "ไม่ได้อนุมัติ";

/* HTTP result code string */
"unimplemented" = "ยังไม่ได้ทำขึ้น";

/* Unknown filename */
"unknown" = "ไม่ทราบ";

/* HTTP result code string */
"unsupported media type" = "ประเภทสื่อไม่รองรับ";

/* HTTP result code string */
"unsupported version" = "เวอร์ชั่นไม่รองรับ";
